IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_sys_status_regs.xml
<module id="SYS_STATUS_REGS" HW_revision="" description="SYS STATUS Registers">
	<register id="CM_STATUS_INT_FLG" width="32" page="1" offset="0x0" internal="0" description="Status of interrupts due to multiple sources of Cortex-M4 reset. ">
		<bitfield id="GINT" description="Global Interrupt flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CMNMIWDRST" description="CMNMIWDRST caused a reset of CM" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CMSYSRESETREQ" description="CMSYSRESETREQ caused a reset of CM" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CMVECTRESET" description="CMVECTRESET caused a reset of CM" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="CM_STATUS_INT_CLR" width="32" page="1" offset="0x2" internal="0" description="CM_STATUS_INT_FLG clear register">
		<bitfield id="GINT" description="Global Interrupt flag Clear bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMNMIWDRST" description="CMNMIWDRST interrupt flag clear bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMSYSRESETREQ" description="CMSYSRESETREQ interrupt flag clear bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMVECTRESET" description="CMVECTRESET interrupt flag clear bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="CM_STATUS_INT_SET" width="32" page="1" offset="0x4" internal="0" description="CM_STATUS_INT_FLG set register">
		<bitfield id="CMNMIWDRST" description="CMNMIWDRST interrupt flag set bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMSYSRESETREQ" description="CMSYSRESETREQ interrupt flag set bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMVECTRESET" description="CMVECTRESET interrupt flag set bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CM_STATUS_MASK" width="32" page="1" offset="0x6" internal="0" description="CM_STATUS_MASK register">
		<bitfield id="CMNMIWDRST" description="CMNMIWDRST flag mask bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMSYSRESETREQ" description="CMSYSRESETREQ interrupt flag set bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMVECTRESET" description="CMVECTRESET interrupt flag set bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="SYS_ERR_INT_FLG" width="32" page="1" offset="0x10" internal="0" description="Status of interrupts due to multiple different errors in the system.">
		<bitfield id="GINT" description="Global Interrupt flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EMIF_ERR" description="EMIF error event flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="RAM_CORRECTABLE_ERR" description="RAM correctable error flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="FLASH_CORRECTABLE_ERR" description="FLASH correctable error flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="RAM_ACC_VIOL" description="A RAM access vioation flag." begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="SYS_PLL_SLIP" description="System PLL Slip event flag." begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="AUX_PLL_SLIP" description="Auxillary PLL Slip event flag." begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="DCC0" description="DCC0 Interrupt flag." begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="DCC1" description="DCC1 Interrupt flag." begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="DCC2" description="DCC2 Interrupt flag." begin="9" end="9" width="1" rwaccess="R"/>
	</register>
	<register id="SYS_ERR_INT_CLR" width="32" page="1" offset="0x12" internal="0" description="SYS_ERR_INT_FLG clear register">
		<bitfield id="GINT" description="Global Interrupt flag Clear bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EMIF_ERR" description="EMIF_ERR interrupt flag clear bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RAM_CORRECTABLE_ERR" description="RAM_CORRECTABLE_ERR interrupt flag clear bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FLASH_CORRECTABLE_ERR" description="FLASH_CORRECTABLE_ERR interrupt flag clear bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RAM_ACC_VIOL" description="RAM_ACC_VIOL interrupt flag clear bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SYS_PLL_SLIP" description="SYS_PLL_SLIP interrupt flag clear bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="AUX_PLL_SLIP" description="AUX_PLL_SLIP interrupt flag clear bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DCC0" description="DCC0 interrupt flag clear bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="DCC1" description="DCC1 interrupt flag clear bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="DCC2" description="DCC2 interrupt flag clear bit" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="SYS_ERR_INT_SET" width="32" page="1" offset="0x14" internal="0" description="SYS_ERR_INT_FLG set register">
		<bitfield id="EMIF_ERR" description="Reserved" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RAM_CORRECTABLE_ERR" description="RAM_CORRECTABLE_ERR interrupt flag set bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FLASH_CORRECTABLE_ERR" description="FLASH_CORRECTABLE_ERR interrupt flag set bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RAM_ACC_VIOL" description="RAM_ACC_VIOL interrupt flag set bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SYS_PLL_SLIP" description="SYS_PLL_SLIP interrupt flag set bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="AUX_PLL_SLIP" description="AUX_PLL_SLIP interrupt flag set bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DCC0" description="DCC0 interrupt flag set bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="DCC1" description="DCC1 interrupt flag set bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="DCC2" description="DCC2 interrupt flag set bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="SYS_ERR_MASK" width="32" page="1" offset="0x16" internal="0" description="SYS_ERR_MASK register">
		<bitfield id="EMIF_ERR" description="Reserved" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RAM_CORRECTABLE_ERR" description="RAM_CORRECTABLE_ERR flag mask bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FLASH_CORRECTABLE_ERR" description="FLASH_CORRECTABLE_ERR flag mask bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RAM_ACC_VIOL" description="RAM_ACC_VIOL flag mask bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SYS_PLL_SLIP" description="SYS_PLL_SLIP flag mask bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="AUX_PLL_SLIP" description="AUX_PLL_SLIP flag mask bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DCC0" description="DCC0 flag mask bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="DCC1" description="DCC1 flag mask bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="DCC2" description="DCC2 flag mask bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
</module>
